Revit 2026 API

# RibbonPanelAddItem Method

---

Adds a Ribbon item to the panel.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RibbonItem AddItem(
	RibbonItemData itemData
)
```
```vb
Public Function AddItem (
	itemData As RibbonItemData
) As RibbonItem
```
```cpp
public:
RibbonItem^ AddItem(
	RibbonItemData^ itemData
)
```
```fsharp
member AddItem :
        itemData : RibbonItemData -> RibbonItem
```

#### Parameters

itemData RibbonItemData
     Data containing information about the new item.

#### Return Value

RibbonItem The added Ribbon item.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when itemData is . |
| ArgumentException | Thrown when an item with the itemData.Name already exists in the panel or the data is not of the correct type. |

The new item may either be a PushButton, PulldownButton, SplitButon, RadioButtonGroup, ComboBox, or TextBox depending upon the type of data passed in. The new item may be created as a large-size vertical control in the panel.

#### Reference

RibbonPanel Class

Autodesk.Revit.UI Namespace